Tekla.Structures.DrawingInternal.DrawingExtensions
Drawing extension methods.

Tekla.Structures.DrawingInternal.DrawingExtensions.CachedSelect(Tekla.Structures.Drawing.Drawing)
Selects the object instance from the model database.
drawing: The drawing.
Returns: True on success.

Tekla.Structures.DrawingInternal.DrawingExtensions.CachedModify(Tekla.Structures.Drawing.Drawing)
Modifies this instance in the model database.
drawing: The drawing.
Returns: True on success.

Tekla.Structures.DrawingInternal.DrawingExtensions.GetPlotFileName(Tekla.Structures.Drawing.Drawing,System.Boolean)
Get plot file name.
Remarks:
Note: The returned plot file name can contain invalid file name characters.
drawing: The drawing.
includeRevisionInfo: Whether to include revision info.
Returns: The plot file name or an empty string if an error occured.

Tekla.Structures.DrawingInternal.DrawingExtensions.GetPlotFileNameExt(Tekla.Structures.Drawing.Drawing,Tekla.Structures.Drawing.IncludeRevisionMarkEnum)
Get plot file name.
Remarks:
Note: The returned plot file name can contain invalid file name characters.
drawing: The drawing.
includeRevisionInfo: How or if to include revision info.
Returns: The plot file name or an empty string if an error occured.

Tekla.Structures.DrawingInternal.DrawingExtensions.IsDrawingNumberingUpToDate(Tekla.Structures.Drawing.Drawing)
Checks whether the numbering of the related model object has gone out of date.
drawing: The drawing.
Returns: True if the numbering is up to date, otherwise false.

Tekla.Structures.DrawingInternal.DrawingExtensions.GetDrawingCloningSourceData(Tekla.Structures.Drawing.Drawing)
Gets the cloning source data of the drawing.
drawing: The drawing to check.
Returns: The source collection, source library and source drawing as a tuple.

Tekla.Structures.DrawingInternal.DrawingExtensions.GetDgGuid(Tekla.Structures.Drawing.Drawing)
Gets the drawing Dg file GUID value.
drawing: the drawing.
Returns: The Dg file GUID value.

Tekla.Structures.DrawingInternal.DrawingExtensions.DbOperation(Tekla.Structures.Drawing.Drawing,Tekla.Structures.DrawingInternal.QueryTypeEnum,System.Nullable{Tekla.Structures.DrawingInternal.grDrawingCreationSource_e})
Run Tekla.Structures.Drawing.Drawing.DbOperation(Tekla.Structures.DrawingInternal.QueryTypeEnum,System.Nullable{Tekla.Structures.DrawingInternal.grDrawingCreationSource_e}).
drawing: The drawing object.
operationType: The operation type.
OverrideTrackingSource: The override tracking source.
Returns: Return status of the result.